# StairstypeIsAssembledStairs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeIsAssembledStairs Property
ParameterTypeId Class See Also
---
"Assembled Stair": Whether stairs is assembled
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeIsAssembledStairs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeIsAssembledStairs As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeIsAssembledStairs {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace